; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-2-5)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	)
(:init
	(at plane1 city3)
	(= (capacity plane1) 10938)
	(= (fuel plane1) 3319)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 9)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 8)
	(at plane2 city0)
	(= (capacity plane2) 4278)
	(= (fuel plane2) 252)
	(= (slow-burn plane2) 2)
	(= (fast-burn plane2) 4)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 2)
	(at person1 city5)
	(at person2 city5)
	(at person3 city0)
	(at person4 city4)
	(at person5 city5)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 883)
	(= (distance city0 city2) 968)
	(= (distance city0 city3) 515)
	(= (distance city0 city4) 521)
	(= (distance city0 city5) 824)
	(= (distance city1 city0) 883)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 890)
	(= (distance city1 city3) 955)
	(= (distance city1 city4) 791)
	(= (distance city1 city5) 593)
	(= (distance city2 city0) 968)
	(= (distance city2 city1) 890)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 938)
	(= (distance city2 city4) 507)
	(= (distance city2 city5) 676)
	(= (distance city3 city0) 515)
	(= (distance city3 city1) 955)
	(= (distance city3 city2) 938)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 618)
	(= (distance city3 city5) 730)
	(= (distance city4 city0) 521)
	(= (distance city4 city1) 791)
	(= (distance city4 city2) 507)
	(= (distance city4 city3) 618)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 734)
	(= (distance city5 city0) 824)
	(= (distance city5 city1) 593)
	(= (distance city5 city2) 676)
	(= (distance city5 city3) 730)
	(= (distance city5 city4) 734)
	(= (distance city5 city5) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane2 city1)
	(at person1 city4)
	(at person2 city4)
	(at person3 city1)
	(at person4 city4)
	(at person5 city3)
	))

(:metric minimize (+ (* 4 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (refuel plane1 city3)
   changed: (fuel plane1) from 3319 to 10938
   goals met: 1 of 6
2. (board person3 plane2 city0)
   deleted: (at person3 city0)
   added: (in person3 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 1 of 6
3. (refuel plane2 city0)
   changed: (fuel plane2) from 252 to 4278
   goals met: 1 of 6
4. (fly plane2 city0 city1)
   deleted: (at plane2 city0)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 0 to 1766, (fuel plane2) from 4278 to 2512
   goals met: 2 of 6
5. (debark person3 plane2 city1)
   deleted: (in person3 plane2)
   added: (at person3 city1)
   changed: (onboard plane2) from 1 to 0
   goals met: 3 of 6
6. (fly plane1 city3 city5)
   deleted: (at plane1 city3)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 1766 to 4686, (fuel plane1) from 10938 to 8018
   goals met: 3 of 6
7. (board person1 plane1 city5)
   deleted: (at person1 city5)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 6
8. (board person2 plane1 city5)
   deleted: (at person2 city5)
   added: (in person2 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 3 of 6
9. (board person5 plane1 city5)
   deleted: (at person5 city5)
   added: (in person5 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 3 of 6
10. (fly plane1 city5 city4)
   deleted: (at plane1 city5)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 4686 to 7622, (fuel plane1) from 8018 to 5082
   goals met: 3 of 6
11. (debark person1 plane1 city4)
   deleted: (in person1 plane1)
   added: (at person1 city4)
   changed: (onboard plane1) from 3 to 2
   goals met: 4 of 6
12. (debark person2 plane1 city4)
   deleted: (in person2 plane1)
   added: (at person2 city4)
   changed: (onboard plane1) from 2 to 1
   goals met: 5 of 6
13. (fly plane1 city4 city3)
   deleted: (at plane1 city4)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 7622 to 10094, (fuel plane1) from 5082 to 2610
   goals met: 5 of 6
14. (debark person5 plane1 city3)
   deleted: (in person5 plane1)
   added: (at person5 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 6 of 6
